# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12-seg instance segmentation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 5 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n-seg.yaml' will call yolo12-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 294 layers, 2,855,056 parameters, 2,855,040 gradients, 10.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 294 layers, 9,938,592 parameters, 9,938,576 gradients, 35.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 314 layers, 22,505,376 parameters, 22,505,360 gradients, 123.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 510 layers, 28,756,992 parameters, 28,756,976 gradients, 145.1 GFLOPs
  x: [1.00, 1.50, 512] # summary: 510 layers, 64,387,264 parameters, 64,387,248 gradients, 324.6 GFLOPs

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DPConv1, [64, 3, 2]] # 0-P1/2 320
  - [-1, 1, DPConv1, [128, 3, 2]] # 1-P2/4 160
  - [-1, 2, DPcatch, [256, False, 0.25]]
  - [-1, 1, DPConv1, [256, 3, 2]] # 3-P3/8  80
  - [-1, 2, DPcatch, [512, False, 0.25]]
  - [-1, 1, DPConv1, [512, 3, 2]] # 5-P4/16  40
  - [-1, 4, DPcatch, [512, True, 4]]
  - [-1, 1, DWConv, [1024, 3, 2]] # 7-P5/32  20
  - [-1, 4, DPcatch, [1024, True, 1]] # 8

#backbone2
  - [1, 2, DCTcatch, [256, False, 0.25]]  # 9
  - [-1, 1, DPConv1, [256, 3, 2]] #
  - [-1, 2, DCTcatch, [512, False, 0.25]]
  - [-1, 1, DPConv1, [512, 3, 2]] # 12
  - [-1, 4, DCTcatch, [512, True]]
  - [-1, 1, DWConv, [1024, 3, 2]] # 14
  - [-1, 4, DCTcatch, [1024, True]] # 15

#fusion
  - [[2, 9], 1, cwFModule, []]   # 16
  - [[4, 11], 1, cwFModule, []]  # 17
  - [[6, 13], 1, cwFModule, []]
  - [[8, 15], 1, cwFModule, []]  # 19


# YOLO12n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 18], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, DCTcatch, [512, False, -1]] # 22

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 17], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, DCTcatch, [256, False, -1]] # 25
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #26
  - [[-1, 16], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, DWConv, [256, 3, 1]]
  
  - [-1, 1, DPConv1, [512, 3, 2]]   #29
  - [-1, 2, DCTcatch, [256, False, -1]] # 30

  - [-1, 1, DPConv1, [256, 3, 2]]
  - [[-1, 22], 1, Concat, [1]] # cat head 32
  - [-1, 2, DPcatch, [512, False, -1]] # 33

  - [-1, 1, DPConv1, [512, 3, 2]]
  - [[-1, 19], 1, Concat, [1]] # cat head P5
  - [-1, 2, DPcatch, [1024, True]] # 36 (P5/32-large)


  - [[28, 30, 33, 36], 1, Segment, [nc, 32, 256]] # Detect(P3, P4, P5) 37

